In [1]:
import numpy as np
import pandas as pd
from matplotlib import pyplot as plt
import seaborn as sns
import scipy

In [2]:
data = pd.read_csv("C:\\Users\\darre\\Downloads\\data.csv")

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   user_id                    1000 non-null   int64
 1   age                        1000 non-null   int64
 2   signup_date                1000 non-null   object
 3   last_purchase_date         1000 non-null   object
 4   total_purchases            1000 non-null   int64
 5   total_spent                1000 non-null   float64
 6   favorite_product_category  1000 non-null   object
 7   location                   1000 non-null   object
 8   gender                     1000 non-null   object
 9   email_domain               1000 non-null   object
dtypes: float64(1), int64(3), object(6)
memory usage: 78.2+ KB

In [4]:
data.describe()

           user_id          age  total_purchases  total_spent
count  1000.000000  1000.000000      1000.000000  1000.000000
mean    500.500000    48.769000        24.553000  1006.185110
std     288.819436    17.924758        14.221091   565.591399
min       1.000000    18.000000         1.000000    21.674472
25%     250.750000    33.000000        12.000000   505.387035
50%     500.500000    49.000000        24.000000  1015.924107
75%     750.250000    65.000000        37.250000  1470.408267
max    1000.000000    79.000000        49.000000  1999.004071

In [5]:
data.head()

,user_id,age,signup_date,last_purchase_date,total_purchases,total_spent,favorite_product_category,location,gender,email_domain
0,1,33,1978-11-01 17:03,2020-05-11 4:13,10,840.954993,books,Lake Gerald,female,gmail.com
1,2,32,2016-04-08 14:19,1959-01-07 5:45,2,1147.412095,books,North Justinburgh,male,yahoo.com
2,3,19,2021-03-08 7:01,2006-10-29 16:56,6,1301.284835,books,West Alec,female,yahoo.com
3,4,48,2006-01-11 11:04,1966-07-01 20:22,8,1404.261405,books,Annaton,male,hotmail.com
4,5,75,1985-06-16 1:41,2013-05-14 12:44,3,1968.752964,books,East Markburgh,female,yahoo.com

In [9]:
data['email_domain'].unique()

array(['gmail.com', 'yahoo.com', 'hotmail.com'], dtype=object)

In [10]:
data['gender'].unique()

array(['female', 'male'], dtype=object)

In [11]:
data['favorite_product_category'].unique()

array(['books', 'home', 'electronics', 'clothing', 'beauty'], dtype=object)

In [14]:
data['signup_date'] = pd.to_datetime(data['signup_date'])
data['last_purchase_date'] = pd.to_datetime(data['signup_date'])